zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rif.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_rif.c
  * @author  MCD Application Team
  * @brief   RIF HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of RIF:
  *           + RISC Initialization and Configuration functions
  *           + IAC Initialization and Configuration functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                  ##### RIF main features #####
  ==============================================================================

  ==============================================================================
                  ##### How to use this driver #####
  ==============================================================================
  [..]
    The RIF HAL driver can be used as follows:

    (#) Configure or get back securable peripherals attributes using
        HAL_RISC_ConfigPeriphAttributes() / HAL_RISC_GetConfigPeriphAttributes()

    (#) Illegal access detection can be configured through IAC sub-block using
        following functions: HAL_IAC_DisableIT() / HAL_IAC_EnableIT()

    (#) Illegal access flags can be retrieved through HAL_IAC_GetFlag() and
        HAL_IAC_ClearFlag() functions

    (#) Illegal access interrupt service routing is served by HAL_RIF_IRQHandler()
        and user can add his own code using HAL_IAC_Callback()

  @endverbatim
  ******************************************************************************

  */
#ifndef STM32MP2xx_HAL_RIF_C
#define STM32MP2xx_HAL_RIF_C

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal.h"

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/** @defgroup RIF RIF
  * @brief RIF HAL module driver
  * @{
  */

#ifdef HAL_RIF_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/** @defgroup RIF_Exported_Functions RIF Exported Functions
  * @{
  */

/** @defgroup RIF_Exported_Functions_Group1  RISC Configuration functions
  * @brief    RISC Configuration functions
  *
  @verbatim
  ==============================================================================
            ##### RISC Configuration functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to configure RISC
    RISC is Resource isolation Slave Controller
@endverbatim
  * @{
  */
#if defined(CORE_CM33) || defined(CORE_CA35)

#if defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE)
/**
  * @brief  Configure RISC on a single peripheral.
  * @param  PeriphAttributes Peripheral attributes, see @ref RIF_Periph_Desc.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RISC_ConfigPeriphAttributes(RIF_Periph_Desc *PeriphAttributes)
{
  /* Check Periph Attributes */
  if (PeriphAttributes == NULL)
  {
    return HAL_ERROR;
  }

  /* Check Periph Id */
  if (!IS_RIF_PERIPHERAL(PeriphAttributes->PeriphId))
  {
    return HAL_ERROR;
  }

  /* Check Global Lock */
  if (HAL_RIF_IS_RISC_GLOCK())
  {
    return HAL_ERROR;
  }

  /* Check Resource Lock */
  if (HAL_RIF_IS_RISC_RLOCK(PeriphAttributes->PeriphId))
  {
    return HAL_ERROR;
  }

  /* Clear registers before configuration */
  HAL_RIF_CLEAR_RISC_CFEN(PeriphAttributes->PeriphId);
  HAL_RIF_CLEAR_RISC_SEMEN(PeriphAttributes->PeriphId);
  HAL_RIF_CLEAR_RISC_SEC(PeriphAttributes->PeriphId);
  HAL_RIF_CLEAR_RISC_PRIV(PeriphAttributes->PeriphId);

  /* Secure attribute */
  if (PeriphAttributes->SecEnable)
  {
    HAL_RIF_SET_RISC_SEC(PeriphAttributes->PeriphId);
  }
  /* Privilege attribute */
  if (PeriphAttributes->PrivEnable)
  {
    HAL_RIF_SET_RISC_PRIV(PeriphAttributes->PeriphId);
  }

  /* Static CID */
  HAL_RIF_SET_RISC_SCID(PeriphAttributes->PeriphId, PeriphAttributes->Scid);
  /* Semaphore White List */
  HAL_RIF_SET_RISC_SEMWLCX(PeriphAttributes->PeriphId, PeriphAttributes->SemWl);

  /* Compartiment attribute */
  if (PeriphAttributes->CidEnable)
  {
    HAL_RIF_SET_RISC_CFEN(PeriphAttributes->PeriphId);
  }
  /* Semaphore attribute */
  if (PeriphAttributes->SemEnable)
  {
    HAL_RIF_SET_RISC_SEMEN(PeriphAttributes->PeriphId);
  }
  /* Resource Lock attribute */
  if (PeriphAttributes->LockEnable)
  {
    HAL_RIF_SET_RISC_RLOCK(PeriphAttributes->PeriphId);
  }

  return HAL_OK;
}
#endif  /* defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE) */

/**
  * @brief  Get RISC configuration on a single peripheral or on all peripherals.
  * @param  PeriphId Peripheral identifier.
  *         This parameter can be a value of @ref RIF_Peripheral_Identification.
  * @param  PeriphAttributes Peripheral attribute pointer.
  *         This parameter can be a value of @ref RIF_Periph_Desc.
  *         If PeriphId target a single peripheral, pointer on a single element.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RISC_GetConfigPeriphAttributes(uint32_t PeriphId, RIF_Periph_Desc *PeriphAttributes)
{
  /* Check Periph Id */
  if (!IS_RIF_PERIPHERAL(PeriphId))
  {
    return HAL_ERROR;
  }

