zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rif.c
  /* Check Periph Attributes */
  if (PeriphAttributes == NULL)
  {
    return HAL_ERROR;
  }

  PeriphAttributes->PeriphId = PeriphId;
  PeriphAttributes->SecEnable = (uint32_t)HAL_RIF_IS_RISC_SEC(PeriphAttributes->PeriphId);
  PeriphAttributes->PrivEnable = (uint32_t)HAL_RIF_IS_RISC_PRIV(PeriphAttributes->PeriphId);
  PeriphAttributes->CidEnable = (_Bool)HAL_RIF_IS_RISC_CFEN(PeriphAttributes->PeriphId);
  PeriphAttributes->SemEnable = (_Bool)HAL_RIF_IS_RISC_SEMEN(PeriphAttributes->PeriphId);
  PeriphAttributes->Scid = HAL_RIF_READ_RISC_SCID(PeriphAttributes->PeriphId);
  PeriphAttributes->SemWl = HAL_RIF_READ_RISC_SEMWL(PeriphAttributes->PeriphId);
  PeriphAttributes->LockEnable = (uint32_t)HAL_RIF_IS_RISC_RLOCK(PeriphAttributes->PeriphId);

  return HAL_OK;
}

#if defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE)
/**
  * @brief  Lock RIF peripheral global configuration.
  * @param  none
  * @retval none.
  */
void HAL_RIF_PeriphGLock()
{
  HAL_RIF_SET_RISC_GLOCK();
}
#endif /* defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE) */

/**
  * @brief  Get RIF peripheral global lock configuration.
  * @param  none
  * @retval Lock State (RIF_PERIPH_GLOCK_OFF or RIF_PERIPH_GLOCK_ON)
  */
uint32_t HAL_RIF_GetPeriphGLock()
{
  return HAL_RIF_IS_RISC_GLOCK();
}

#if defined(RIF_LPSRAM1) && defined(RIF_LPSRAM2) && defined(RIF_LPSRAM3)
/**
  * @}
  */

/** @defgroup RIF_Exported_Functions_Group2 RIF RISAL configuration functions
  * @{
  *
  @verbatim
  ==============================================================================
            ##### RISAL configuration functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to configure RISAL
    RISAL is resource isolation slave unit for address space - Lite version
@endverbatim
  */
#if defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE)
/**
  * @brief  RIF RISAL memory configuration.
  * @param  MemAttributes RISAL Memory attribute pointer.
  *         This parameter can be a value of @ref RIF_MemRisal_Desc.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RISAL_ConfigMemAttributes(RIF_MemRisal_Desc *MemAttributes)
{
  /* Check Mem attributes */
  if (MemAttributes == NULL)
  {
    return HAL_ERROR;
  }

  /* Check RISAL instance */
  if (!IS_RISAL_INSTANCE(MemAttributes->Instance))
  {
    return HAL_ERROR;
  }

  /* Check Global Lock */
  if (HAL_RIF_IS_RISC_GLOCK())
  {
    return HAL_ERROR;
  }

  switch (MemAttributes->Instance)
  {
    case RIF_LPSRAM1:
    {
      if (MemAttributes->SubRegId == RIF_RISAL_MEM_SUBREGA) /* SubRegA */
      {
        /* Clear registers before configuration */
        HAL_RIF_CLEAR_RISAL1_SUBREGA_SREN();
        HAL_RIF_CLEAR_RISAL1_SUBREGA_SEC();
        HAL_RIF_CLEAR_RISAL1_SUBREGA_PRIV();

        if (MemAttributes->SecEnable)
        {
          HAL_RIF_SET_RISAL1_SUBREGA_SEC();
        }
        if (MemAttributes->PrivEnable)
        {
          HAL_RIF_SET_RISAL1_SUBREGA_PRIV();
        }

        HAL_RIF_SET_RISAL1_SUBREGA_SRCID(MemAttributes->Srcid);

        if (MemAttributes->SubRegEnable)
        {
          HAL_RIF_SET_RISAL1_SUBREGA_SREN();
        }
        if (MemAttributes->LockEnable)
        {
          HAL_RIF_SET_RISAL1_SUBREGA_RLOCK();
        }
      }
      else /* SubRegB */
      {
        /* Clear registers before configuration */
        HAL_RIF_CLEAR_RISAL1_SUBREGB_SREN();
        HAL_RIF_CLEAR_RISAL1_SUBREGB_SEC();
        HAL_RIF_CLEAR_RISAL1_SUBREGB_PRIV();

        if (MemAttributes->SecEnable)
        {
          HAL_RIF_SET_RISAL1_SUBREGB_SEC();
        }
        if (MemAttributes->PrivEnable)
        {
          HAL_RIF_SET_RISAL1_SUBREGB_PRIV();
        }

        HAL_RIF_SET_RISAL1_SUBREGB_SRCID(MemAttributes->Srcid);

        if (MemAttributes->SubRegEnable)
        {
          HAL_RIF_SET_RISAL1_SUBREGB_SREN();
        }
        if (MemAttributes->LockEnable)
        {
          HAL_RIF_SET_RISAL1_SUBREGB_RLOCK();
        }
      }
    }
    break;
    case RIF_LPSRAM2:
    {
      if (MemAttributes->SubRegId == RIF_RISAL_MEM_SUBREGA) /* SubRegA */
      {
        /* Clear registers before configuration */
        HAL_RIF_CLEAR_RISAL2_SUBREGA_SREN();
        HAL_RIF_CLEAR_RISAL2_SUBREGA_SEC();
        HAL_RIF_CLEAR_RISAL2_SUBREGA_PRIV();

        if (MemAttributes->SecEnable)
        {
          HAL_RIF_SET_RISAL2_SUBREGA_SEC();
        }
        if (MemAttributes->PrivEnable)
        {
          HAL_RIF_SET_RISAL2_SUBREGA_PRIV();
        }

        HAL_RIF_SET_RISAL2_SUBREGA_SRCID(MemAttributes->Srcid);

        if (MemAttributes->SubRegEnable)
        {
          HAL_RIF_SET_RISAL2_SUBREGA_SREN();
        }
        if (MemAttributes->LockEnable)
        {
          HAL_RIF_SET_RISAL2_SUBREGA_RLOCK();
        }
      }
      else /* SubRegB */
      {
        /* Clear registers before configuration */
        HAL_RIF_CLEAR_RISAL2_SUBREGB_SREN();
        HAL_RIF_CLEAR_RISAL2_SUBREGB_SEC();
        HAL_RIF_CLEAR_RISAL2_SUBREGB_PRIV();

        if (MemAttributes->SecEnable)
        {
          HAL_RIF_SET_RISAL2_SUBREGB_SEC();
        }
        if (MemAttributes->PrivEnable)
        {
          HAL_RIF_SET_RISAL2_SUBREGB_PRIV();
        }

        HAL_RIF_SET_RISAL2_SUBREGB_SRCID(MemAttributes->Srcid);

        if (MemAttributes->SubRegEnable)
        {
          HAL_RIF_SET_RISAL2_SUBREGB_SREN();
        }
        if (MemAttributes->LockEnable)
        {
          HAL_RIF_SET_RISAL2_SUBREGB_RLOCK();
        }
      }
    }
    break;
    case RIF_LPSRAM3:
    {
      if (MemAttributes->SubRegId == RIF_RISAL_MEM_SUBREGA) /* SubRegA */
      {
        /* Clear registers before configuration */
        HAL_RIF_CLEAR_RISAL3_SUBREGA_SREN();
        HAL_RIF_CLEAR_RISAL3_SUBREGA_SEC();
        HAL_RIF_CLEAR_RISAL3_SUBREGA_PRIV();

        if (MemAttributes->SecEnable)
        {
          HAL_RIF_SET_RISAL3_SUBREGA_SEC();
        }
        if (MemAttributes->PrivEnable)
        {
          HAL_RIF_SET_RISAL3_SUBREGA_PRIV();
        }

        HAL_RIF_SET_RISAL3_SUBREGA_SRCID(MemAttributes->Srcid);
        HAL_RIF_SET_RISAL3_SUBREGA_SUBSTART(MemAttributes->SubRegStart / RIF_RISAL_MEM_GRANULARITY);
        HAL_RIF_SET_RISAL3_SUBREGA_SUBLENGTH(MemAttributes->SubRegLength / RIF_RISAL_MEM_GRANULARITY);

