zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rif.c
        if (MemAttributes->SubRegEnable)
        {
          HAL_RIF_SET_RISAL3_SUBREGA_SREN();
        }
        if (MemAttributes->LockEnable)
        {
          HAL_RIF_SET_RISAL3_SUBREGA_RLOCK();
        }
      }
      else /* SubRegB */
      {
        /* Clear registers before configuration */
        HAL_RIF_CLEAR_RISAL3_SUBREGB_SREN();
        HAL_RIF_CLEAR_RISAL3_SUBREGB_SEC();
        HAL_RIF_CLEAR_RISAL3_SUBREGB_PRIV();

        if (MemAttributes->SecEnable)
        {
          HAL_RIF_SET_RISAL3_SUBREGB_SEC();
        }
        if (MemAttributes->PrivEnable)
        {
          HAL_RIF_SET_RISAL3_SUBREGB_PRIV();
        }

        HAL_RIF_SET_RISAL3_SUBREGB_SRCID(MemAttributes->Srcid);
        HAL_RIF_SET_RISAL3_SUBREGB_SUBSTART(MemAttributes->SubRegStart / RIF_RISAL_MEM_GRANULARITY);
        HAL_RIF_SET_RISAL3_SUBREGB_SUBLENGTH(MemAttributes->SubRegLength / RIF_RISAL_MEM_GRANULARITY);

        if (MemAttributes->SubRegEnable)
        {
          HAL_RIF_SET_RISAL3_SUBREGB_SREN();
        }
        if (MemAttributes->LockEnable)
        {
          HAL_RIF_SET_RISAL3_SUBREGB_RLOCK();
        }
      }
    }
    break;
    default:
    {
      return HAL_ERROR;
    }
    break;
  }
  return HAL_OK;
}
#endif /* defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE) */

/**
  * @brief  Get RIF RISAL memory configuration.
  * @param  Instance RISAL Memory instance.
  * @param  SubRegId RISAL Memory sub region id.
  * @param  MemAttributes RISAL Memory attribute pointer.
  *         This parameter can be a value of @ref RIF_MemRisal_Desc.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RISAL_GetConfigMemAttributes(uint32_t Instance, uint32_t SubRegId, \
                                                   RIF_MemRisal_Desc *MemAttributes)
{
  /* Check RISAL instance */
  if (!IS_RISAL_INSTANCE(Instance))
  {
    return HAL_ERROR;
  }

  /* Check RISAL subreg id */
  if (!IS_RISAL_SUBREG(SubRegId))
  {
    return HAL_ERROR;
  }

  /* Check Mem attributes */
  if (MemAttributes == NULL)
  {
    return HAL_ERROR;
  }

  MemAttributes->Instance = Instance;
  MemAttributes->SubRegId = SubRegId;

  switch (Instance)
  {
    case RIF_LPSRAM1:
      if (SubRegId == RIF_RISAL_MEM_SUBREGA)
      {
        MemAttributes->SecEnable = (uint32_t)HAL_RIF_IS_RISAL1_SUBREGA_SEC();
        MemAttributes->PrivEnable = (uint32_t)HAL_RIF_IS_RISAL1_SUBREGA_PRIV();
        MemAttributes->SubRegEnable = (uint32_t)HAL_RIF_IS_RISAL1_SUBREGA_SREN();
        MemAttributes->LockEnable = (uint32_t)HAL_RIF_IS_RISAL1_SUBREGA_RLOCK();
        MemAttributes->Srcid = HAL_RIF_READ_RISAL1_SUBREGA_SRCID();
        MemAttributes->SubRegStart = 0x0;
        MemAttributes->SubRegLength = 0x0;
      }
      else
      {
        MemAttributes->SecEnable = (uint32_t)HAL_RIF_IS_RISAL1_SUBREGB_SEC();
        MemAttributes->PrivEnable = (uint32_t)HAL_RIF_IS_RISAL1_SUBREGB_PRIV();
        MemAttributes->SubRegEnable = (uint32_t)HAL_RIF_IS_RISAL1_SUBREGB_SREN();
        MemAttributes->LockEnable = (uint32_t)HAL_RIF_IS_RISAL1_SUBREGB_RLOCK();
        MemAttributes->Srcid = HAL_RIF_READ_RISAL1_SUBREGB_SRCID();
        MemAttributes->SubRegStart = 0x0;
        MemAttributes->SubRegLength = 0x0;
      }
      break;
    case RIF_LPSRAM2:
      if (SubRegId == RIF_RISAL_MEM_SUBREGA)
      {
        MemAttributes->SecEnable = (uint32_t)HAL_RIF_IS_RISAL2_SUBREGA_SEC();
        MemAttributes->PrivEnable = (uint32_t)HAL_RIF_IS_RISAL2_SUBREGA_PRIV();
        MemAttributes->SubRegEnable = (uint32_t)HAL_RIF_IS_RISAL2_SUBREGA_SREN();
        MemAttributes->LockEnable = (uint32_t)HAL_RIF_IS_RISAL2_SUBREGA_RLOCK();
        MemAttributes->Srcid = HAL_RIF_READ_RISAL2_SUBREGA_SRCID();
        MemAttributes->SubRegStart = 0x0;
        MemAttributes->SubRegLength = 0x0;
      }
      else
      {
        MemAttributes->SecEnable = (uint32_t)HAL_RIF_IS_RISAL2_SUBREGB_SEC();
        MemAttributes->PrivEnable = (uint32_t)HAL_RIF_IS_RISAL2_SUBREGB_PRIV();
        MemAttributes->SubRegEnable = (uint32_t)HAL_RIF_IS_RISAL2_SUBREGB_SREN();
        MemAttributes->LockEnable = (uint32_t)HAL_RIF_IS_RISAL2_SUBREGB_RLOCK();
        MemAttributes->Srcid = HAL_RIF_READ_RISAL2_SUBREGB_SRCID();
        MemAttributes->SubRegStart = 0x0;
        MemAttributes->SubRegLength = 0x0;
      }
      break;
    case RIF_LPSRAM3:
      if (SubRegId == RIF_RISAL_MEM_SUBREGA)
      {
        MemAttributes->SecEnable = (uint32_t)HAL_RIF_IS_RISAL3_SUBREGA_SEC();
        MemAttributes->PrivEnable = (uint32_t)HAL_RIF_IS_RISAL3_SUBREGA_PRIV();
        MemAttributes->SubRegEnable = (uint32_t)HAL_RIF_IS_RISAL3_SUBREGA_SREN();
        MemAttributes->LockEnable = (uint32_t)HAL_RIF_IS_RISAL3_SUBREGA_RLOCK();
        MemAttributes->Srcid = HAL_RIF_READ_RISAL3_SUBREGA_SRCID();
        MemAttributes->SubRegStart = HAL_RIF_READ_RISAL3_SUBREGA_SUBSTART();
        MemAttributes->SubRegLength = HAL_RIF_READ_RISAL3_SUBREGA_SUBLENGTH();
      }
      else
      {
        MemAttributes->SecEnable = (uint32_t)HAL_RIF_IS_RISAL3_SUBREGB_SEC();
        MemAttributes->PrivEnable = (uint32_t)HAL_RIF_IS_RISAL3_SUBREGB_PRIV();
        MemAttributes->SubRegEnable = (uint32_t)HAL_RIF_IS_RISAL3_SUBREGB_SREN();
        MemAttributes->LockEnable = (uint32_t)HAL_RIF_IS_RISAL3_SUBREGB_RLOCK();
        MemAttributes->Srcid = HAL_RIF_READ_RISAL3_SUBREGB_SRCID();
        MemAttributes->SubRegStart = (RIF_RISAL_MEM_GRANULARITY * HAL_RIF_READ_RISAL3_SUBREGB_SUBSTART());
        MemAttributes->SubRegLength = (RIF_RISAL_MEM_GRANULARITY * HAL_RIF_READ_RISAL3_SUBREGB_SUBLENGTH());
      }
      break;
    default:
      return HAL_ERROR;
      break;
  }
  return HAL_OK;
}
/**
  * @}
  */
#endif /* RISAL1 && RISAL2 && RISAL3 */

/** @defgroup RIF_Exported_Functions_Group3 RIMC functions
  * @{
  *
  @verbatim
  ==============================================================================
            ##### RIMC functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to configure RIMC
    RIMC is resource isolation master controller.
@endverbatim
  */
#if defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE)
/**
  * @brief  RIF RIMC trusted attributes configuration.
  * @param  Attributes RIMC Trusted attribute pointer.
  *         This parameter can be a value of @ref RIF_RIMC_TrustedDesc.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RIMC_ConfigTrustedAttributes(RIF_RIMC_TrustedDesc *Attributes)
{
  /* Check Attributes */
  if (Attributes == NULL)
  {
    return HAL_ERROR;
  }
  /* Check TD CID */
  if (!IS_RIMC_TDCID(Attributes->TDcid))
  {
    return HAL_ERROR;
  }
  /* Check DAP CID */
  if (!IS_RIMC_DAPCID(Attributes->DAPcid))
  {
    return HAL_ERROR;
  }
  /* Check Global Lock */
  if (HAL_RIF_IS_RIMC_GLOCK())
  {
    return HAL_ERROR;
  }

  /* Configure RIMC Trusted parameters */
  HAL_RIF_SET_RIMC_DAPCID(Attributes->DAPcid);
  HAL_RIF_SET_RIMC_TDCID(Attributes->TDcid);

  return HAL_OK;
}

/**
  * @brief  RIF RIMC master attributes configuration.
  * @param  Attributes RIMC Master attribute pointer.
  *         This parameter can be a value of @ref RIF_RIMC_MasterDesc.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RIMC_ConfigMasterAttributes(RIF_RIMC_MasterDesc *Attributes)
{
  /* Check Attributes */
  if (Attributes == NULL)
  {
    return HAL_ERROR;
  }
  /* Check Master ID */
  if (!IS_RIMC_MASTERID(Attributes->MasterId))
  {
    return HAL_ERROR;
  }
  /* Check Master CID */
  if (!IS_RIMC_MASTERCID(Attributes->Mcid))
  {
    return HAL_ERROR;
  }
  /* Check Global Lock */
  if (HAL_RIF_IS_RIMC_GLOCK())
  {
    return HAL_ERROR;
  }

  /* Configure RIMC Master attributes */
  HAL_RIF_SET_RIMC_MCID(Attributes->MasterId, Attributes->Mcid);
  if (Attributes->SecEnable)
  {
    HAL_RIF_SET_RIMC_SEC(Attributes->MasterId);
  }
  if (Attributes->PrivEnable)
  {
    HAL_RIF_SET_RIMC_PRIV(Attributes->MasterId);
  }
  if (Attributes->CidEnable)
  {
    HAL_RIF_SET_RIMC_CIDSEL(Attributes->MasterId);
  }

  return HAL_OK;
}
#endif /* defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE) */

/**
  * @brief  Get RIF RIMC trusted attributes configuration.
  * @param  Attributes RIMC Trusted attribute pointer.
  *         This parameter can be a value of @ref RIF_RIMC_TrustedDesc.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RIMC_GetConfigTrustedAttributes(RIF_RIMC_TrustedDesc *Attributes)
{
  /* Check Attributes */
  if (Attributes == NULL)
  {
    return HAL_ERROR;
  }

  /* Get RIMC Trusted parameters */
  Attributes->DAPcid = HAL_RIF_READ_RIMC_DAPCID();
  Attributes->TDcid = HAL_RIF_READ_RIMC_TDCID();

  return HAL_OK;
}

/**
  * @brief  Get RIF RIMC master attributes configuration.
  * @param  MasterId RIMC Master Id.
  * @param  Attributes RIMC Master attribute pointer.
  *         This parameter can be a value of @ref RIF_RIMC_MasterDesc.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RIMC_GetConfigMasterAttributes(uint32_t MasterId, RIF_RIMC_MasterDesc *Attributes)
{
  /* Check Attributes */
  if (Attributes == NULL)
  {
    return HAL_ERROR;
  }
  /* Check Master ID */
  if (!IS_RIMC_MASTERID(MasterId))
  {
    return HAL_ERROR;
  }

  /* Get RIMC Master attributes */
  Attributes->SecEnable = (uint32_t)HAL_RIF_IS_RIMC_SEC(Attributes->MasterId);
  Attributes->PrivEnable = (uint32_t)HAL_RIF_IS_RIMC_PRIV(Attributes->MasterId);
  Attributes->CidEnable = (_Bool)HAL_RIF_IS_RIMC_CIDSEL(Attributes->MasterId);
  Attributes->Mcid = HAL_RIF_READ_RIMC_MCID(Attributes->MasterId);

  return HAL_OK;
}

