zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rif.c
#if defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE)
/**
  * @brief  Lock RIMC global configuration.
  * @param  none
  * @retval none
  */
void HAL_RIMC_GLock()
{
  HAL_RIF_SET_RIMC_GLOCK();
}
#endif /* defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE) */

/**
  * @brief  Get RIMC global lock configuration.
  * @param  none
  * @retval Lock State (RIF_RIMC_GLOCK_OFF or RIF_RIMC_GLOCK_ON)
  */
uint32_t HAL_RIMC_GetGLock()
{
  return HAL_RIF_IS_RIMC_GLOCK();
}
/**
  * @}
  */

/** @defgroup RIF_Exported_Functions_Group4 RIF RISAB functions
  * @{
  *
  @verbatim
  ==============================================================================
            ##### RISAB functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to configure RISAB
    RISAB is Resource isolation slave unit for address space protection
  (block-based).
@endverbatim
  */
#if defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE)
/**
  * @brief  RIF RISAB memory configuration.
  * @param  PageId RISAB Memory Page Id.
  * @param  MemAttributes RISAB Memory attribute pointer.
  *         This parameter can be a value of @ref RIF_MemRisab_Desc.
  *         Same configuration for all pages and blocks by default
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RISAB_ConfigMemAttributes(uint32_t PageId, RIF_MemRisab_Desc *MemAttributes)
{
  uint32_t cid;

  /* Check RISAB PageId */
  if (!IS_RISAB_PAGEID(PageId))
  {
    return HAL_ERROR;
  }
  /* Check Mem attributes */
  if (MemAttributes == NULL)
  {
    return HAL_ERROR;
  }
  /* Check RISAB instance */
  if (!IS_RISAB_INSTANCE(MemAttributes->Instance))
  {
    return HAL_ERROR;
  }

  /* Check Global Lock */
  if (HAL_RIF_IS_RISAB_GLOCK(MemAttributes->Instance))
  {
    return HAL_ERROR;
  }
  /* Check Page Lock */
  if (HAL_RIF_IS_RISAB_PG_LOCK(MemAttributes->Instance, PageId))
  {
    return HAL_ERROR;
  }

  /* Get Current CID */
  cid = MemAttributes->Cid;

  /* Reset all registers before configuration */
  HAL_RIF_CLEAR_RISAB_PG_CFEN(MemAttributes->Instance, PageId);
  HAL_RIF_CLEAR_RISAB_PG_DCEN(MemAttributes->Instance, PageId);
  HAL_RIF_CLEAR_RISAB_PG_SEC(MemAttributes->Instance, PageId);
  HAL_RIF_CLEAR_RISAB_PG_PRIV(MemAttributes->Instance, PageId);
#if defined(CORE_CM33)
  HAL_RIF_CLEAR_RISAB_PG_C2_PRIV(MemAttributes->Instance, PageId);
#endif /* defined(CORE_CM33) */
  HAL_RIF_CLEAR_RISAB_PG_CX_PRIV(MemAttributes->Instance, cid, PageId);
  HAL_RIF_CLEAR_RISAB_PG_CX_READ(MemAttributes->Instance, cid, PageId);
  HAL_RIF_CLEAR_RISAB_PG_CX_WRITE(MemAttributes->Instance, cid, PageId);
  HAL_RIF_SET_RISAB_PG_DCCID(MemAttributes->Instance, PageId, 0x0);
  HAL_RIF_CLEAR_RISAB_SRWIAD(MemAttributes->Instance);

  /* Configure RISAB parameters */
  if (MemAttributes->SecAccessEnable)
  {
    HAL_RIF_SET_RISAB_SRWIAD(MemAttributes->Instance);
  }
  if (MemAttributes->PageSecEnable)
  {
    HAL_RIF_SET_RISAB_PG_SEC(MemAttributes->Instance, PageId);
  }
  if (MemAttributes->PagePrivEnable)
  {
    HAL_RIF_SET_RISAB_PG_PRIV(MemAttributes->Instance, PageId);
  }
#if defined(CORE_CM33)
  if (MemAttributes->C2PagePrivEnable)
  {
    HAL_RIF_SET_RISAB_PG_C2_PRIV(MemAttributes->Instance, PageId);
  }
#endif /*defined(CORE_CM33) */
  if (MemAttributes->CidPagePrivEnable)
  {
    HAL_RIF_SET_RISAB_PG_CX_PRIV(MemAttributes->Instance, cid, PageId);
  }
  if (MemAttributes->CidPageReadEnable)
  {
    HAL_RIF_SET_RISAB_PG_CX_READ(MemAttributes->Instance, cid, PageId);
  }
  if (MemAttributes->CidPageWriteEnable)
  {
    HAL_RIF_SET_RISAB_PG_CX_WRITE(MemAttributes->Instance, cid, PageId);
  }
  if (MemAttributes->CidPageEnable)
  {
    HAL_RIF_SET_RISAB_PG_CFEN(MemAttributes->Instance, PageId);
  }
  HAL_RIF_SET_RISAB_PG_DCCID(MemAttributes->Instance, PageId, MemAttributes->Dccid);
  if (MemAttributes->DccidPageEnable)
  {
    HAL_RIF_SET_RISAB_PG_DCEN(MemAttributes->Instance, PageId);
  }
  if (MemAttributes->PageLockEnable)
  {
    HAL_RIF_SET_RISAB_PG_LOCK(MemAttributes->Instance, PageId);
  }

  return HAL_OK;
}
#endif /* defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE) */

/**
  * @brief  Get RIF RISAB memory configuration.
  * @param  PageId RISAB Memory Page Id.
  * @param  PageId RISAB Memory Compartiment Id.
  * @param  Instance RISAB Memory instance.
  * @param  MemAttributes RISAB Memory attribute pointer.
  *         This parameter can be a value of @ref RIF_MemRisab_Desc.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RISAB_GetConfigMemAttributes(uint32_t Instance, uint32_t PageId, \
                                                   uint32_t Cid, RIF_MemRisab_Desc *MemAttributes)
{
  /* Check RISAB instance */
  if (!IS_RISAB_INSTANCE(Instance))
  {
    return HAL_ERROR;
  }
  /* Check RISAB PageId */
  if (!IS_RISAB_PAGEID(PageId))
  {
    return HAL_ERROR;
  }
  /* Check RISAB Cid */
  if (!IS_RISAB_CID(Cid))
  {
    return HAL_ERROR;
  }
  /* Check Mem attributes */
  if (MemAttributes == NULL)
  {
    return HAL_ERROR;
  }

  /* Reset RISAB parameters */
  MemAttributes->SecAccessEnable = 0;
  MemAttributes->PageSecEnable = 0;
  MemAttributes->PagePrivEnable = 0;
  MemAttributes->CidPageEnable = 0;
  MemAttributes->C2PagePrivEnable = 0;
  MemAttributes->CidPagePrivEnable = 0;
  MemAttributes->CidPageReadEnable = 0;
  MemAttributes->CidPageWriteEnable = 0;
  MemAttributes->DccidPageEnable = 0;
  MemAttributes->Dccid = 0;
  MemAttributes->PageLockEnable = 0;

  /* Get RISAB parameters */
  MemAttributes->Instance = Instance;
  MemAttributes->Cid = Cid;
  MemAttributes->SecAccessEnable = (uint32_t)HAL_RIF_IS_RISAB_SRWIAD(MemAttributes->Instance);
  MemAttributes->CidPagePrivEnable = (_Bool)HAL_RIF_IS_RISAB_PG_CX_PRIV(MemAttributes->Instance, Cid, PageId);
  MemAttributes->CidPageReadEnable = (_Bool)HAL_RIF_IS_RISAB_PG_CX_READ(MemAttributes->Instance, Cid, PageId);
  MemAttributes->CidPageWriteEnable = (_Bool)HAL_RIF_IS_RISAB_PG_CX_WRITE(MemAttributes->Instance, Cid, PageId);
  MemAttributes->CidPageEnable = (_Bool)HAL_RIF_IS_RISAB_PG_CFEN(MemAttributes->Instance, PageId);
  MemAttributes->DccidPageEnable = (_Bool)HAL_RIF_IS_RISAB_PG_DCEN(MemAttributes->Instance, PageId);
  MemAttributes->PageLockEnable = (uint32_t)HAL_RIF_IS_RISAB_PG_LOCK(MemAttributes->Instance, PageId);
  MemAttributes->Dccid = HAL_RIF_READ_RISAB_PG_DCCID(MemAttributes->Instance, PageId);
  if (HAL_RIF_READ_RISAB_PG_SEC(MemAttributes->Instance, PageId) == RISAB_PGSECCFGR_SEC)
  {
    MemAttributes->PageSecEnable = 1;
  }
  if (HAL_RIF_READ_RISAB_PG_PRIV(MemAttributes->Instance, PageId) == RISAB_PGPRIVCFGR_PRIV)
  {
    MemAttributes->PagePrivEnable = 1;
  }
  if (HAL_RIF_READ_RISAB_PG_C2_PRIV(MemAttributes->Instance, PageId) == RISAB_PGC2PRIVCFGR_PRIV)
  {
    MemAttributes->C2PagePrivEnable = 1;
  }

  return HAL_OK;
}

