zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rif.c
#if defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE)
/**
  * @brief  Lock RISAB memory global configuration.
  * @param  Instance RISAB Memory instance.
  * @retval none.
  */
void HAL_RISAB_MemGLock(uint32_t Instance)
{
  /* Check RISAB instance */
  if (IS_RISAB_INSTANCE(Instance))
  {
    HAL_RIF_SET_RISAB_GLOCK(Instance);
  }
}
#endif /* defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE) */

/**
  * @brief  Get RISAB memory global lock configuration.
  * @param  Instance RISAB Memory instance.
  * @retval Lock State (RIF_RISAB_LOCK_OFF or RIF_RISAB_LOCK_ON)
  */
uint32_t HAL_RISAB_GetMemGLock(uint32_t Instance)
{
  /* Check RISAB instance */
  if (IS_RISAB_INSTANCE(Instance))
  {
    return HAL_RIF_IS_RISAB_GLOCK(Instance);
  }
  return (RIF_HAL_ERROR);
}
/**
  * @}
  */
/** @defgroup RIF_Exported_Functions_Group5 RIF RISAF functions
  * @{
  *
  @verbatim
  ==============================================================================
            ##### RISAF functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to configure RISAF
    RISAF is Resource isolation slave unit for address space protection
    (full version).
@endverbatim
  */

#if defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE)
/**
  * @brief  RIF RISAF memory region configuration.
  * @param  RegionId RISAF Memory Region Id.
  * @param  MemAttributes RISAF Memory attribute pointer.
  *         This parameter can be a value of @ref RIF_MemRisafReg_Desc.
  *         Same configuration for all pages and blocks by default
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RISAF_ConfigMemRegionAttributes(uint32_t RegionId, RIF_MemRisafReg_Desc *MemAttributes)
{
  /* Check RISAF RegionId */
  if (!IS_RISAF_REGIONID(RegionId))
  {
    return HAL_ERROR;
  }
  /* Check Mem attributes */
  if (MemAttributes == NULL)
  {
    return HAL_ERROR;
  }
  /* Check RISAF instance */
  if (!IS_RISAF_INSTANCE(MemAttributes->Instance))
  {
    return HAL_ERROR;
  }
  /* Check Global Lock */
  if (HAL_RIF_IS_RISAF_GLOCK(MemAttributes->Instance))
  {
    return HAL_ERROR;
  }
  /* Check CID PRIV */
  if (!IS_RISAF_CIDPRIV(MemAttributes->CidRegPriv))
  {
    return HAL_ERROR;
  }
  /* Check CID READ */
  if (!IS_RISAF_CIDREAD(MemAttributes->CidRegRead))
  {
    return HAL_ERROR;
  }
  /* Check CID WRITE */
  if (!IS_RISAF_CIDWRITE(MemAttributes->CidRegWrite))
  {
    return HAL_ERROR;
  }

  /* Reset all registers before configuration */
  HAL_RIF_CLEAR_RISAF_REG_BREN(MemAttributes->Instance, RegionId);
  HAL_RIF_CLEAR_RISAF_REG_SEC(MemAttributes->Instance, RegionId);
  HAL_RIF_CLEAR_RISAF_REG_ENC(MemAttributes->Instance, RegionId);
  HAL_RIF_CLEAR_RISAF_REG_CIDPRIV(MemAttributes->Instance, RegionId, RISAF_REGCFGR_PRIV);
  HAL_RIF_CLEAR_RISAF_REG_CIDREAD(MemAttributes->Instance, RegionId, RISAF_REGCIDCFGR_RDEN);
  HAL_RIF_CLEAR_RISAF_REG_CIDWRITE(MemAttributes->Instance, RegionId, RISAF_REGCIDCFGR_WREN);

  /* Configure RISAF REGION parameters */
  if (MemAttributes->RegSecEnable)
  {
    HAL_RIF_SET_RISAF_REG_SEC(MemAttributes->Instance, RegionId);
  }
  if (MemAttributes->RegEncEnable)
  {
    HAL_RIF_SET_RISAF_REG_ENC(MemAttributes->Instance, RegionId);
  }
  HAL_RIF_SET_RISAF_REG_CIDPRIV(MemAttributes->Instance, RegionId, MemAttributes->CidRegPriv);
  HAL_RIF_SET_RISAF_REG_CIDREAD(MemAttributes->Instance, RegionId, MemAttributes->CidRegRead);
  HAL_RIF_SET_RISAF_REG_CIDWRITE(MemAttributes->Instance, RegionId, MemAttributes->CidRegWrite);
  if (MemAttributes->Instance == RIF_DDR)
  {
    /* Use absolute base address */
    HAL_RIF_SET_RISAF_REG_STARTR(MemAttributes->Instance, RegionId, MemAttributes->RegAddress);
    HAL_RIF_SET_RISAF_REG_ENDR(MemAttributes->Instance, RegionId\
                               , MemAttributes->RegAddress + MemAttributes->RegSize - 1);
  }
  else
  {
    /* Use offset base address */
    HAL_RIF_SET_RISAF_REG_STARTR(MemAttributes->Instance, RegionId, 0x0);
    HAL_RIF_SET_RISAF_REG_ENDR(MemAttributes->Instance, RegionId, MemAttributes->RegSize - 1);
  }
  if (MemAttributes->RegEnable)
  {
    HAL_RIF_SET_RISAF_REG_BREN(MemAttributes->Instance, RegionId);
  }

  return HAL_OK;
}

/**
  * @brief  RIF RISAF memory subregion configuration.
  * @param  RegionId RISAF Memory Region Id.
  * @param  MemAttributes RISAF Memory attribute pointer.
  *         This parameter can be a value of @ref RIF_MemRisafSubReg_Desc.
  *         Same configuration for all pages and blocks by default
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RISAF_ConfigMemSubRegionAttributes(uint32_t RegionId, RIF_MemRisafSubReg_Desc *MemAttributes)
{
  /* Check RISAF RegionId */
  if (!IS_RISAF_REGIONID(RegionId))
  {
    return HAL_ERROR;
  }
  /* Check Mem attributes */
  if (MemAttributes == NULL)
  {
    return HAL_ERROR;
  }
  /* Check RISAF instance */
  if (!IS_RISAF_INSTANCE(MemAttributes->Instance))
  {
    return HAL_ERROR;
  }
  /* Check Global Lock */
  if (HAL_RIF_IS_RISAF_GLOCK(MemAttributes->Instance))
  {
    return HAL_ERROR;
  }
  /* Check RISAF SubRegionId */
  if (!IS_RISAF_SUBREGID(MemAttributes->SubRegId))
  {
    return HAL_ERROR;
  }
  /* Check DCCID */
  if (!IS_RISAF_DCCID(MemAttributes->SubRegDccid))
  {
    return HAL_ERROR;
  }
  /* Check SRCID */
  if (!IS_RISAF_SRCID(MemAttributes->SubRegSrcid))
  {
    return HAL_ERROR;
  }

  if (MemAttributes->SubRegId == RIF_RISAF_MEM_SUBREGA)
  {
    /* Check SubReg Resource Lock */
    if (HAL_RIF_IS_RISAF_SUBREGA_RLOCK(MemAttributes->Instance, RegionId))
    {
      return HAL_ERROR;
    }

    /* Reset all registers before configuration */
    HAL_RIF_CLEAR_RISAF_SUBREGA_SREN(MemAttributes->Instance, RegionId);
    HAL_RIF_CLEAR_RISAF_SUBREGA_SEC(MemAttributes->Instance, RegionId);
    HAL_RIF_CLEAR_RISAF_SUBREGA_PRIV(MemAttributes->Instance, RegionId);
    HAL_RIF_CLEAR_RISAF_SUBREGA_RDEN(MemAttributes->Instance, RegionId);
    HAL_RIF_CLEAR_RISAF_SUBREGA_WREN(MemAttributes->Instance, RegionId);
    HAL_RIF_CLEAR_RISAF_SUBREGA_DCEN(MemAttributes->Instance, RegionId);
    HAL_RIF_SET_RISAF_SUBREGA_DCCID(MemAttributes->Instance, RegionId, 0x0);
    HAL_RIF_SET_RISAF_SUBREGA_SRCID(MemAttributes->Instance, RegionId, 0x0);

    /* Configure RISAF SUBREGION parameters */
    if (MemAttributes->SubRegSecEnable)
    {
      HAL_RIF_SET_RISAF_SUBREGA_SEC(MemAttributes->Instance, RegionId);
    }
    if (MemAttributes->SubRegPrivEnable)
    {
      HAL_RIF_SET_RISAF_SUBREGA_PRIV(MemAttributes->Instance, RegionId);
    }
    if (MemAttributes->SubRegReadEnable)
    {
      HAL_RIF_SET_RISAF_SUBREGA_RDEN(MemAttributes->Instance, RegionId);
    }
    if (MemAttributes->SubRegWriteEnable)
    {
      HAL_RIF_SET_RISAF_SUBREGA_WREN(MemAttributes->Instance, RegionId);
    }
    if (MemAttributes->SubRegDCidEnable)
    {
      HAL_RIF_SET_RISAF_SUBREGA_DCEN(MemAttributes->Instance, RegionId);
    }
    HAL_RIF_SET_RISAF_SUBREGA_DCCID(MemAttributes->Instance, RegionId, MemAttributes->SubRegDccid);
    HAL_RIF_SET_RISAF_SUBREGA_SRCID(MemAttributes->Instance, RegionId, MemAttributes->SubRegSrcid);
    if (MemAttributes->Instance == RIF_DDR)
    {
      /* Use absolute base address */
      HAL_RIF_SET_RISAF_SUBREGA_STARTR(MemAttributes->Instance, RegionId, MemAttributes->SubRegAddress);
      HAL_RIF_SET_RISAF_SUBREGA_ENDR(MemAttributes->Instance, RegionId, \
                                     MemAttributes->SubRegAddress + MemAttributes->SubRegSize - 1);
    }
    else
    {
      /* Use offset base address */
      HAL_RIF_SET_RISAF_SUBREGA_STARTR(MemAttributes->Instance, RegionId, MemAttributes->SubRegAddress);
      HAL_RIF_SET_RISAF_SUBREGA_ENDR(MemAttributes->Instance, RegionId, MemAttributes->SubRegSize - 1);
    }
    if (MemAttributes->SubRegEnable)
    {
      HAL_RIF_SET_RISAF_SUBREGA_SREN(MemAttributes->Instance, RegionId);
    }
    if (MemAttributes->SubRegLockEnable)
    {
      HAL_RIF_SET_RISAF_SUBREGA_RLOCK(MemAttributes->Instance, RegionId);
    }
  }
  else
  {
    /* Check SubReg Resource Lock */
    if (HAL_RIF_IS_RISAF_SUBREGB_RLOCK(MemAttributes->Instance, RegionId))
    {
      return HAL_ERROR;
    }

    /* Reset all registers before configuration */
    HAL_RIF_CLEAR_RISAF_SUBREGB_SREN(MemAttributes->Instance, RegionId);
    HAL_RIF_CLEAR_RISAF_SUBREGB_SEC(MemAttributes->Instance, RegionId);
    HAL_RIF_CLEAR_RISAF_SUBREGB_PRIV(MemAttributes->Instance, RegionId);
    HAL_RIF_CLEAR_RISAF_SUBREGB_RDEN(MemAttributes->Instance, RegionId);
    HAL_RIF_CLEAR_RISAF_SUBREGB_WREN(MemAttributes->Instance, RegionId);
    HAL_RIF_CLEAR_RISAF_SUBREGB_DCEN(MemAttributes->Instance, RegionId);
    HAL_RIF_SET_RISAF_SUBREGB_DCCID(MemAttributes->Instance, RegionId, 0x0);
    HAL_RIF_SET_RISAF_SUBREGB_SRCID(MemAttributes->Instance, RegionId, 0x0);

    /* Configure RISAF SUBREGION parameters */
    if (MemAttributes->SubRegSecEnable)
    {
      HAL_RIF_SET_RISAF_SUBREGB_SEC(MemAttributes->Instance, RegionId);
    }
    if (MemAttributes->SubRegPrivEnable)
    {
      HAL_RIF_SET_RISAF_SUBREGB_PRIV(MemAttributes->Instance, RegionId);
    }
    if (MemAttributes->SubRegReadEnable)
    {
      HAL_RIF_SET_RISAF_SUBREGB_RDEN(MemAttributes->Instance, RegionId);
    }
    if (MemAttributes->SubRegWriteEnable)
    {
      HAL_RIF_SET_RISAF_SUBREGB_WREN(MemAttributes->Instance, RegionId);
    }
    if (MemAttributes->SubRegDCidEnable)
    {
      HAL_RIF_SET_RISAF_SUBREGB_DCEN(MemAttributes->Instance, RegionId);
    }
    HAL_RIF_SET_RISAF_SUBREGB_DCCID(MemAttributes->Instance, RegionId, MemAttributes->SubRegDccid);
    HAL_RIF_SET_RISAF_SUBREGB_SRCID(MemAttributes->Instance, RegionId, MemAttributes->SubRegSrcid);
    if (MemAttributes->Instance == RIF_DDR)
    {
      /* Use absolute base address */
      HAL_RIF_SET_RISAF_SUBREGB_STARTR(MemAttributes->Instance, RegionId, MemAttributes->SubRegAddress);
      HAL_RIF_SET_RISAF_SUBREGB_ENDR(MemAttributes->Instance, RegionId, \
                                     MemAttributes->SubRegAddress + MemAttributes->SubRegSize - 1);
    }
    else
    {
      /* Use offset base address */
      HAL_RIF_SET_RISAF_SUBREGB_STARTR(MemAttributes->Instance, RegionId, MemAttributes->SubRegAddress);
      HAL_RIF_SET_RISAF_SUBREGB_ENDR(MemAttributes->Instance, RegionId, MemAttributes->SubRegSize - 1);
    }
    if (MemAttributes->SubRegEnable)
    {
      HAL_RIF_SET_RISAF_SUBREGB_SREN(MemAttributes->Instance, RegionId);
    }
    if (MemAttributes->SubRegLockEnable)
    {
      HAL_RIF_SET_RISAF_SUBREGB_RLOCK(MemAttributes->Instance, RegionId);
    }
  }

  return HAL_OK;
}

/**
  * @brief  RIF RISAF memory encrypt configuration.
  * @param  RegionId RISAF Memory Region Id.
  * @param  MemAttributes RISAF Memory attribute pointer.
  *         This parameter can be a value of @ref RIF_MemRisafEncKey_Desc.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RISAF_ConfigMemEncryptAttributes(RIF_MemRisafEncKey_Desc *MemAttributes)
{
  /* Check Mem attributes */
  if (MemAttributes == NULL)
  {
    return HAL_ERROR;
  }
  /* Check RISAF instance */
  if (!IS_RISAF_INSTANCE(MemAttributes->Instance))
  {
    return HAL_ERROR;
  }
  /* Check Global Lock */
  if (HAL_RIF_IS_RISAF_GLOCK(MemAttributes->Instance))
  {
    return HAL_ERROR;
  }

  /* Configure RISAF Encryption Key parameters */
  HAL_RIF_SET_RISAF_KEYR(MemAttributes->Instance, 0, MemAttributes->Key0);
  HAL_RIF_SET_RISAF_KEYR(MemAttributes->Instance, 1, MemAttributes->Key1);
  HAL_RIF_SET_RISAF_KEYR(MemAttributes->Instance, 2, MemAttributes->Key2);
  HAL_RIF_SET_RISAF_KEYR(MemAttributes->Instance, 3, MemAttributes->Key3);

  /* Check Key is valid */
  if (!HAL_RIF_IS_RISAF_KEYVALID(MemAttributes->Instance))
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
#endif /* defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE) */

/**
  * @brief  Get RIF RISAF memory configuration.
  * @param  Instance RISAF Memory instance.
  * @param  RegionId RISAF Memory Region Id.
  * @param  MemAttributes RISAF Memory attribute pointer.
  *         This parameter can be a value of @ref RIF_MemRisafReg_Desc.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RISAF_GetConfigMemRegionAttributes(uint32_t Instance, uint32_t RegionId, \
                                                         RIF_MemRisafReg_Desc *MemAttributes)
{
  /* Check RISAF instance */
  if (!IS_RISAF_INSTANCE(Instance))
  {
    return HAL_ERROR;
  }

