zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rif.c
  /* Check RISAF RegionId */
  if (!IS_RISAF_REGIONID(RegionId))
  {
    return HAL_ERROR;
  }

  /* Check Mem attributes */
  if (MemAttributes == NULL)
  {
    return HAL_ERROR;
  }

  /* Get RISAF parameters */
  MemAttributes->Instance = Instance;
  MemAttributes->RegEnable = (uint32_t)HAL_RIF_IS_RISAF_REG_BREN(MemAttributes->Instance, RegionId);
  MemAttributes->RegSecEnable = (uint32_t)HAL_RIF_IS_RISAF_REG_SEC(MemAttributes->Instance, RegionId);
  MemAttributes->RegEncEnable = (uint32_t)HAL_RIF_IS_RISAF_REG_ENC(MemAttributes->Instance, RegionId);
  MemAttributes->CidRegPriv = HAL_RIF_READ_RISAF_REG_CIDPRIV(MemAttributes->Instance, RegionId);
  MemAttributes->CidRegRead = HAL_RIF_READ_RISAF_REG_CIDREAD(MemAttributes->Instance, RegionId);
  MemAttributes->CidRegWrite = HAL_RIF_READ_RISAF_REG_CIDWRITE(MemAttributes->Instance, RegionId);
  MemAttributes->RegAddress = HAL_RIF_READ_RISAF_STARTR(MemAttributes->Instance, RegionId);
  MemAttributes->RegSize = HAL_RIF_READ_RISAF_ENDR(MemAttributes->Instance, RegionId) + 1U;

  return HAL_OK;
}

/**
  * @brief  Get RIF RISAF memory subregion configuration.
  * @param  Instance RISAF Memory instance.
  * @param  RegionId RISAF Memory Region Id.
  * @param  SubRegionId RISAF Memory SubRegion Id.
  * @param  MemAttributes RISAF Memory attribute pointer.
  *         This parameter can be a value of @ref RIF_MemRisafSubReg_Desc.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_RISAF_GetConfigMemSubRegionAttributes(uint32_t Instance, uint32_t RegionId, \
                                                            uint32_t SubRegionId, \
                                                            RIF_MemRisafSubReg_Desc *MemAttributes)
{
  /* Check RISAF instance */
  if (!IS_RISAF_INSTANCE(Instance))
  {
    return HAL_ERROR;
  }

  /* Check RISAF RegionId */
  if (!IS_RISAF_REGIONID(RegionId))
  {
    return HAL_ERROR;
  }

  /* Check RISAF SubRegionId */
  if (!IS_RISAF_SUBREGID(SubRegionId))
  {
    return HAL_ERROR;
  }

  /* Check Mem attributes */
  if (MemAttributes == NULL)
  {
    return HAL_ERROR;
  }

  /* Get RISAF parameters */
  MemAttributes->Instance = Instance;
  MemAttributes->SubRegId = SubRegionId;

  if (MemAttributes->SubRegId == RIF_RISAF_MEM_SUBREGA)
  {
    MemAttributes->SubRegEnable = (uint32_t)HAL_RIF_IS_RISAF_SUBREGA_SREN(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegSecEnable = (uint32_t)HAL_RIF_IS_RISAF_SUBREGA_SEC(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegPrivEnable = (uint32_t)HAL_RIF_IS_RISAF_SUBREGA_PRIV(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegReadEnable = (uint32_t)HAL_RIF_IS_RISAF_SUBREGA_RDEN(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegWriteEnable = (uint32_t)HAL_RIF_IS_RISAF_SUBREGA_WREN(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegDCidEnable = (uint32_t)HAL_RIF_IS_RISAF_SUBREGA_DCEN(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegDccid = HAL_RIF_READ_RISAF_SUBREGA_DCCID(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegSrcid = HAL_RIF_READ_RISAF_SUBREGA_SRCID(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegAddress = HAL_RIF_READ_RISAF_ASTARTR(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegSize = HAL_RIF_READ_RISAF_AENDR(MemAttributes->Instance, RegionId) + 1U;
    MemAttributes->SubRegLockEnable = (uint32_t)HAL_RIF_IS_RISAF_SUBREGA_RLOCK(MemAttributes->Instance, RegionId);;
  }
  else
  {
    MemAttributes->SubRegEnable = (uint32_t)HAL_RIF_IS_RISAF_SUBREGB_SREN(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegSecEnable = (uint32_t)HAL_RIF_IS_RISAF_SUBREGB_SEC(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegPrivEnable = (uint32_t)HAL_RIF_IS_RISAF_SUBREGB_PRIV(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegReadEnable = (uint32_t)HAL_RIF_IS_RISAF_SUBREGB_RDEN(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegWriteEnable = (uint32_t)HAL_RIF_IS_RISAF_SUBREGB_WREN(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegDCidEnable = (uint32_t)HAL_RIF_IS_RISAF_SUBREGB_DCEN(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegDccid = HAL_RIF_READ_RISAF_SUBREGB_DCCID(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegSrcid = HAL_RIF_READ_RISAF_SUBREGB_SRCID(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegAddress = HAL_RIF_READ_RISAF_BSTARTR(MemAttributes->Instance, RegionId);
    MemAttributes->SubRegSize = HAL_RIF_READ_RISAF_BENDR(MemAttributes->Instance, RegionId) + 1U;
    MemAttributes->SubRegLockEnable = (uint32_t)HAL_RIF_IS_RISAF_SUBREGB_RLOCK(MemAttributes->Instance, RegionId);;
  }

  return HAL_OK;
}

#if defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE)
/**
  * @brief  Lock RISAF memory global configuration.
  * @param  Instance RISAF Memory instance.
  * @retval none.
  */
void HAL_RISAF_MemGLock(uint32_t Instance)
{
  /* Check RISAF instance */
  if (IS_RISAF_INSTANCE(Instance))
  {
    HAL_RIF_SET_RISAF_GLOCK(Instance);
  }
}
#endif /* defined(CORE_CA35) || defined(CORTEX_IN_SECURE_STATE) */

/**
  * @brief  Get RISAF memory global lock configuration.
  * @param  Instance RISAF Memory instance.
  * @retval Lock State (RIF_RISAF_LOCK_OFF or RIF_RISAF_LOCK_ON)
  */
uint32_t HAL_RISAF_GetMemGLock(uint32_t Instance)
{
  /* Check RISAF instance */
  if (IS_RISAF_INSTANCE(Instance))
  {
    return HAL_RIF_IS_RISAF_GLOCK(Instance);
  }
  return (RIF_HAL_ERROR);
}


/**
  * @}
  */

/** @defgroup RIF_Exported_Functions_Group6 IAC Configuration and Control functions
  * @brief    IAC Configuration and Controlfunctions
  *
  @verbatim
  ==============================================================================
            ##### IAC Configuration and Control functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to configure and control IAC
    IAC is Illegal Access Controller
@endverbatim
  * @{
  */

/**
  * @brief  Disable the interrupt associated to a single IAC peripheral or on all peripherals.
  * @param  PeriphId Peripheral identifier.
  *         This parameter can be a value of @ref RIF_Peripheral_Identification.
  *         Use RIF_PERIPH_ALLIP_Msk to select all peripherals.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_IAC_DisableIT(uint32_t PeriphId)
{
  uint32_t reg_index;

  /* check entry parameters */
  assert_param(IS_RIF_PERIPHERAL(PeriphId));

  if ((PeriphId & RIF_PERIPH_ALLIP_Msk) != 0U)
  {
    /* same configuration is applied to all peripherals */
    for (reg_index = 0; reg_index < RIF_PERIPH_REG_MAX; reg_index++)
    {
      CLEAR_REG(IAC->IER[reg_index]);
    }
  }
  else
  {
    /* common case where only one peripheral is configured */
    CLEAR_BIT(IAC->IER[RIF_GET_REG_INDEX(PeriphId) % (sizeof(IAC->IER) / sizeof(IAC->IER[0]))]\
              , 1UL << RIF_GET_PERIPH_POS(PeriphId));
  }

  return HAL_OK;
}

/**
  * @brief  Enable the interrupt associated to a single IAC peripheral or on all peripherals.
  * @param  PeriphId Peripheral identifier.
  *         This parameter can be a value of @ref RIF_Peripheral_Identification.
  *         Use RIF_PERIPH_ALLIP_Msk to select all peripherals.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_IAC_EnableIT(uint32_t PeriphId)
{
  uint32_t reg_index;

  /* check entry parameters */
  assert_param(IS_RIF_PERIPHERAL(PeriphId));

  if ((PeriphId & RIF_PERIPH_ALLIP_Msk) != 0U)
  {
    /* same configuration is applied to all peripherals */
    for (reg_index = 0; reg_index < RIF_PERIPH_REG_MAX; reg_index++)
    {
      /* WRITE_REG(IAC->IER[reg_index], RISC_PERIPH_REG_ALL[reg_index]) */
    }
  }
  else
  {
    /* common case where only one peripheral is configured */
    SET_BIT(IAC->IER[RIF_GET_REG_INDEX(PeriphId)\
                     % (sizeof(IAC->IER) / sizeof(IAC->IER[0]))], 1UL << RIF_GET_PERIPH_POS(PeriphId));
  }

  return HAL_OK;
}

/**
  * @brief  Get IAC flag on a single IAC peripheral or on all peripherals.
  * @param  PeriphId Peripheral identifier.
  *         This parameter can be a value of @ref RIF_Peripheral_Identification.
  *         To select all peripherals, other usable bits have to be set to 0.
  * @param  Flag Pointer to the flags.
  *         If PeriphId target a single peripheral, pointer on a single element.
  *         If all peripherals selected (RIF_PERIPH_ALLIP_Msk) IAC_PERIPH_NUMBER-size
  *         array elements is to be provided.
  *         Element content is either IAC_NO_ILA_EVENT
  *         or IAC_ILA_EVENT_PENDING
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_IAC_GetFlag(uint32_t PeriphId, uint32_t *Flag)
{
  uint32_t i;
  uint32_t reg_index;
  uint32_t reg_value;

  /* check entry parameters */
  assert_param(IS_RIF_PERIPHERAL(PeriphId));

  if (Flag == NULL)
  {
    return HAL_ERROR;
  }

  if ((PeriphId & RIF_PERIPH_ALLIP_Msk) != 0U)
  {
    /* special case where it is applied to all peripherals */
    for (reg_index = 0; reg_index < RIF_PERIPH_REG_MAX; reg_index++)
    {
      reg_value = READ_REG(IAC->ISR[reg_index]);
      for (i = 0U; i < 32U; i++)
      {
        Flag[(reg_index * 32U) + i] = (reg_value & (1UL << i)) >> i;
      }
    }
  }
  else
  {
    /* common case where only one peripheral is concerned */
    Flag[RIF_GET_ARRAY_INDEX(PeriphId)] = READ_BIT(IAC->ISR[RIF_GET_REG_INDEX(PeriphId)\
                                                            % (sizeof(IAC->ISR) / sizeof(IAC->ISR[0]))]\
                                                   , 1UL << RIF_GET_PERIPH_POS(PeriphId));
  }

  return HAL_OK;
}

/**
  * @brief  Clear IAC flag on a single IAC peripheral or on all peripherals.
  * @param  PeriphId Peripheral identifier.
  *         This parameter can be a value of @ref RIF_Peripheral_Identification.
  *         Use RIF_PERIPH_ALLIP_Msk to select all peripherals.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_IAC_ClearFlag(uint32_t PeriphId)
{
  uint32_t reg_index;

  /* check entry parameters */
  assert_param(IS_RIF_PERIPHERAL(PeriphId));

  if ((PeriphId & RIF_PERIPH_ALLIP_Msk) != 0U)
  {
    /* same configuration is applied to all peripherals */
    for (reg_index = 0; reg_index < RIF_PERIPH_REG_MAX; reg_index++)
    {
      /*      WRITE_REG(IAC->ICR[reg_index], RISC_PERIPH_REG_ALL[reg_index]) */
    }
  }
  else
  {
    /* common case where only one peripheral is configured */
    SET_BIT((IAC->ICR[RIF_GET_REG_INDEX(PeriphId) % (sizeof(IAC->ICR) / sizeof(IAC->ICR[0]))])\
            , (1UL << (RIF_GET_PERIPH_POS(PeriphId))));
  }

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup RIF_Exported_Functions_Group7 IRQ related functions
  * @brief    IRQ related functions
  *
  @verbatim
  ==============================================================================
            ##### IRQ related functions #####
  ==============================================================================
  [..]
    This section provides RIF IRQ handling and Callback related function
@endverbatim
  * @{
  */

/**
  * @brief  This function handles RIF interrupt request.
  * @retval None.
  */
void HAL_RIF_IRQHandler(void)
{
  /* Get current IT Flags and IT sources value */
  uint32_t reg_index;
  uint32_t flag;
  uint32_t position;

  for (reg_index = 0; reg_index < RIF_PERIPH_REG_MAX; reg_index++)
  {
    /* Get Mask interrupt and then clear them */
    flag = READ_REG(IAC->ISR[reg_index]);
    WRITE_REG(IAC->ICR[reg_index], flag);

    /* Loop on flag to check, which ones have been raised */
    position = 0;
    while ((position < 32U) && ((flag >> position) != 0x00u))
    {
      if ((flag & (1UL << position)) != 0x00u)
      {
        /* Callback with periph_id (add reg pos to find periph id) */
        HAL_IAC_Callback(position | (reg_index << RIF_PERIPH_REG_Pos));
      }

      /* Position bit to be updated */
      position++;
    }
  }
}

/**
  * @brief  RIF IAC sub-block interrupt callback.
  * @retval None.
  */
__weak void HAL_IAC_Callback(uint32_t PeriphId)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(PeriphId);

  /* NOTE: This function should not be modified. When the callback is needed,
   * the HAL_IAC_Callback is to be implemented in the user file
   */
}
#endif /* defined(CORE_CM33) || defined(CORE_CA35) */

/**
  * @}
  */

/**
  * @}
  */

#endif /*HAL_RIF_MODULE_ENABLED*/

/**
  * @}
  */

/**
  * @}
  */

#endif /* STM32MP2xx_HAL_RIF_C */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
